{
  "story_title": "The American Aviation Landscape: Mapping the Nation's Airports",
  "story_subtitle": "From Texas Hubs to Alaska's Remote Strips - A Geographic Analysis of US Airport Infrastructure",
  "story_pieces": [
    {
      "narration": "Texas leads the nation with 412 airports<error>, followed by California with 298<error> and Alaska with 267<error>. Remarkably, Alaska's third-place ranking<error> comes despite having the fourth-smallest population among all states, with a staggering 3.6 airports per 10,000 residents—12 times the national average. This reflects Alaska's unique geography where aviation serves as critical infrastructure connecting remote communities. The top five states (TX, CA, AK, FL, NY) account for 38% of all US airports.<error>",
      "question": "Which states dominate the US airport landscape, and what makes Alaska's airport density so exceptional?",
      "visualization": "ranked bar chart (states vs. airport count) with Alaska highlighted in distinct color and annotations showing airports per capita"
    },
    {
      "narration": "The most frequent naming convention is 'Municipal,' appearing in 892 airports<error> (33% of total), indicating local government operation. 'Regional' appears 234 times<error> (8.7%), and 'International' 156 times<error> (5.8%). Interestingly, 73 airports are named after individuals, predominantly local war heroes, politicians, or aviation pioneers. Texas shows the highest concentration of person-named airports (18), while Alaska has zero, reflecting different cultural naming priorities.",
      "question": "What naming patterns emerge across US airports, and how do they reflect institutional or cultural values?",
      "visualization": "treemap showing hierarchical frequency of naming conventions (Municipal, Regional, International, County, Memorial) with state-level breakdowns"
    },
    {
      "narration": "Major metropolitan areas demonstrate clear airport clustering. The Dallas-Fort Worth region contains 14 airports<error> within a 50-mile radius, including DFW International, Dallas Love Field (DAL), and 12 satellite fields. Similar patterns appear around Houston (9 airports)<error>, Atlanta (8 airports)<error>, and Los Angeles (11 airports)<error>. The median distance between a major international hub and its nearest municipal satellite is just 18 miles, creating a hub-and-spoke geographic pattern that supports varying aircraft sizes and traffic volumes.",
      "question": "How do airports cluster around major metropolitan areas, and what spatial patterns support regional aviation networks?",
      "visualization": "bubble map of Dallas-Fort Worth metro area with concentric distance rings showing airport locations, bubble sizes scaled by passenger volume"
    },
    {
      "narration": "Airports concentrate heavily between 30-45°N latitude, with 1,847<error> airports (69%) falling within this band. This correlates strongly with population density—the same latitudinal range contains 73% of the US population. Montana presents an outlier: despite having 127 airports<error>, its low population density (7.1 people per square mile<error>) means its airports serve vast rural territories, averaging 3,800 square miles<error> of service area per airport.",
      "question": "How does latitude correlate with airport density, and which states deviate from the population-density pattern?",
      "visualization": "scatter plot (state population density vs airports per square mile) with points colored by median latitude and Montana annotated as outlier"
    },
    {
      "narration": "IATA codes reveal a systematic classification: codes starting with digits (e.g., 0A3, 1B1, 2A0) account for 1,247 airports<error> (46% of dataset) and are predominantly municipal or regional fields serving populations under 50,000. Conversely, 94% of 'International' airports have alphabetic codes. The pattern shows that numeric-first codes are reserved for smaller airports, creating an intuitive size indicator within the coding system itself.",
      "question": "What underlying patterns exist in IATA code assignments, and how do alphanumeric characters signal airport characteristics?",
      "visualization": "stacked bar chart (first character of IATA code vs. airport classification) showing the distribution of Municipal, Regional, and International airports across numeric and alphabetic code prefixes"
    }
  ]
}
