{
  "story_title": "America's Regional Airports: A Geographic Mosaic",
  "story_subtitle": "Uncovering Distribution Patterns, Naming Conventions, and Infrastructure Characteristics Across 10 U.S. Airfields",
  "story_pieces": [
    {
      "narration": "From the Gulf Coast of Mississippi to the Rocky Mountains of Colorado, these 10 airports span 12.1 degrees of latitude (30.69°N to 42.74°N)<error> and 23.9 degrees of longitude (-104.57°W to -80.64°W)<error>, creating a diagonal cross-section through the American heartland.",
      "question": "What geographic range do these regional airports cover across the United States?",
      "visualization": "Interactive US scatter map (latitude vs longitude with state boundaries and coordinate grid)"
    },
    {
      "narration": "The Southeast emerges as a regional hub in this dataset, with 40% of airports concentrated in just three states—Mississippi (2), Florida (1), and Alabama (1)—while the remaining six states each host a single facility, highlighting potential infrastructure clustering.",
      "question": "Which regions show the highest concentration of these airports?",
      "visualization": "US state choropleth map with airport count encoded in color intensity and point markers for exact locations"
    },
    {
      "narration": "Airport naming conventions reveal institutional and geographic identities: 40% reference geographic features or locations (Meadow Lake, Capitol), 20% honor individuals (Thigpen, Gragg-Wade), 20% carry county designations (Tishomingo County, Columbiana County), 10% are municipal (Livingston Municipal), and 10% are memorial sites (Memphis Memorial).",
      "question": "What patterns emerge in how these airports are named?",
      "visualization": "Sunburst chart with hierarchical categorization of naming conventions and airport examples at each leaf"
    },
    {
      "narration": "IATA code analysis shows systematic prefix clustering: codes beginning with '00', '01', and '02' each represent 30% of the airports (3 each), while '03' represents the remaining 10%, suggesting these identifiers follow a structured assignment pattern for smaller regional facilities.",
      "question": "What do IATA code patterns reveal about airport classification?",
      "visualization": "Treemap with nested rectangles representing IATA code prefix hierarchy and individual airports"
    },
    {
      "narration": "Each airport uniquely serves its namesake city—from Colorado Springs to East Liverpool—creating a network of facilities that connect local communities to national aviation infrastructure, with no duplicate city names appearing in the dataset.",
      "question": "How uniquely distributed are these airports across American cities?",
      "visualization": "Labeled point map with airport names and city callouts showing spatial uniqueness"
    }
  ]
}