{
  "story_title": "Hidden Aviation Geography: America's Regional Airport Landscape",
  "story_subtitle": "Uncovering Geographic Clusters, Naming Patterns, and Infrastructure Codes Across 20 Small Airports",
  "story_pieces": [
    {
      "narration": "Mississippi emerges as the dominant state in this dataset, hosting 4 of the 20 airports (20%)—a remarkable concentration that far exceeds any other state's representation. These facilities, from Bay Springs to Belmont, reveal a robust network of small regional airports serving the Magnolia State's communities.",
      "question": "Why does Mississippi account for one-fifth of all airports in this dataset, and what does this reveal about the state's aviation infrastructure strategy?",
      "visualization": "choropleth map of the United States with states shaded by airport count"
    },
    {
      "narration": "These airports span over 18 degrees of latitude, stretching from the northern plains of North Dakota (48.9°N) to the subtropical climate of Florida (30.7°N). This 1,250-mile north-south range exposes the dataset to vastly different weather systems, terrain, and regional economies—from prairie agriculture to Gulf Coast tourism.",
      "question": "How does this latitudinal diversity reflect the geographic and climatic breadth of America's general aviation network?",
      "visualization": "scatter plot map (latitude vs longitude) with airports as colored points, sized by state representation"
    },
    {
      "narration": "Every airport bears a distinctive three-character IATA code beginning with a numeric digit (0-6), immediately distinguishing them from major commercial hubs like LAX or JFK. This numeric prefix system categorizes smaller, regional facilities, with the 06 block being most populated (5 airports), suggesting a systematic assignment pattern.",
      "question": "What does the numeric IATA code pattern reveal about the classification and hierarchy of these airports within America's aviation infrastructure?",
      "visualization": "stacked bar chart showing distribution of airports by IATA numeric prefix (00-06), with interactive drill-down to individual airports"
    },
    {
      "narration": "Six airports (30%)<error> explicitly embed civic identity into their names through terms like 'Municipal,' 'Memorial,' or 'County.' From 'Rolla Municipal' to 'Calhoun County Airport,' this naming convention signals public ownership and local stewardship, contrasting with private facilities like 'Hilliard Airpark.'",
      "question": "How do naming conventions differentiate publicly-supported community airports from private aviation facilities?",
      "visualization": "word cloud of airport names weighted by frequency of civic terms, overlaid on a civic vs private classification bar chart"
    },
    {
      "narration": "While the dataset spans 41 degrees of longitude—from New York's Hudson Valley (-74.4°W) to Nevada's high desert (-116.0°W)—65% of airports cluster east of the Mississippi River. This eastward skew suggests this sample may reflect the higher density of general aviation infrastructure serving the historically populated eastern half of America.",
      "question": "What explains the eastward bias in this airport sample, and how might it reflect broader patterns of American settlement and regional aviation demand?",
      "visualization": "bubble map of airports across the continental US, with bubble size representing state airport count and color intensity showing east-west distribution"
    }
  ]
}