{
  "story_title": "Mapping America's Regional Airports: A Geographic and Cultural Analysis",
  "story_subtitle": "Exploring state concentration patterns, naming conventions, and spatial distribution across 40 U.S. airports",
  "story_pieces": [
    {
      "narration": "Mississippi dominates this dataset with 6 airports (15%), followed by Alabama with 5 (12.5%) and Nebraska with 4 (10%). These three states account for over a third of all airports, revealing significant sampling concentration in the Southern and Central regions. Seven states maintain dual representation<error> while 11 states<error> have single airports listed.",
      "question": "Which states exhibit the highest airport concentration in this sample, and what might this reveal about data collection patterns?",
      "visualization": "interactive ranked bar chart with regional color-coding and percentage overlays"
    },
    {
      "narration": "The dataset spans extraordinary geographic boundaries: Pilot Station, Alaska is the northernmost (61.94째N) and westernmost (-162.89째W) airport, while Livingston Municipal in Texas is the southernmost (30.69째N). Randall Airport in New York marks the easternmost point (-74.39째W)<error>. This coverage spans 31 degrees of latitude and 88 degrees<error> of longitude, showcasing America's vast aerial infrastructure from Arctic to subtropical regions.",
      "question": "How do these airports define the geographic extremes of U.S. general aviation infrastructure?",
      "visualization": "rotating 3D globe animation with extreme points highlighted and coordinate callouts"
    },
    {
      "narration": "The South leads dramatically with 19 airports (47.5%), driven by Mississippi and Alabama's strong presence. The Midwest follows with 14 airports (35%), while the West and Northeast trail with 4 (10%) and 3 (7.5%) respectively. This distribution contrasts with actual airport density patterns, suggesting regional sampling bias toward the Gulf Coast and Central states.",
      "question": "How does airport distribution across Census regions reflect potential sampling methodology rather than national aviation infrastructure?",
      "visualization": "choropleth map with synchronized small multiples showing airport counts per 10,000 sq miles and per capita"
    },
    {
      "narration": "Governmental naming patterns prevail: 'Municipal' appears in 20% of airports (8 out of 40), while 'County' appears in 12.5% (5 out of 40). Institutional terms like 'Memorial,' 'State,' and 'City/County' reinforce public ownership identity. Only 15% feature unique local identifiers like 'Thigpen' or 'Gragg-Wade,' suggesting these are predominantly community-owned facilities rather than private or corporate airfields.",
      "question": "What do systematic naming conventions reveal about airport ownership models and community identity in this dataset?",
      "visualization": "tree map of naming term frequencies with hierarchical clustering by ownership type"
    },
    {
      "narration": "IATA codes exhibit deliberate architectural patterns: 85% begin with numeric characters, with codes starting with '0' representing 68% of all airports. Geographic encoding appears in codes like '0AK' (Alaska) and '09W' (Washington, DC), while Mississippi's six codes all contain 'M' as the second character. This reveals a hierarchical assignment system where initial digits may indicate region and letters encode state-specific designations.",
      "question": "What systematic logic underlies IATA code assignment, and how do these patterns facilitate geographic identification?",
      "visualization": "character position heatmap matrix with 3x3 grid showing frequency distributions by code position and character type"
    }
  ]
}