{
  "story_title": "Small Airports of America: Decoding General Aviation Infrastructure",
  "story_subtitle": "A Geographic and Structural Analysis of 205<error> US Public-Use Airports",
  "story_pieces": [
    {
      "narration": "Alabama leads the nation with 14 airports<error>, followed closely by Mississippi (13)<error> and Nebraska (12)<error>. The top five states—Alabama, Mississippi, Nebraska, Oklahoma, and New York—account for 61 airports, representing nearly 30% of all facilities in this dataset. These state-level concentrations reveal how local governance and geography shape aviation infrastructure investment.",
      "question": "Which states have emerged as leaders in small airport infrastructure, and what factors might explain this geographic concentration?",
      "visualization": "animated choropleth map (US states shaded by airport count with 5-tier color scale)"
    },
    {
      "narration": "The Southern region dominates with 81 airports (39.5% of the total<error>), creating a dense network across the Gulf Coast and Mississippi River corridor. The Midwest follows with 63 airports (30.7%<error>23/200), while the West (38 airports, 18.5%) and Northeast (23 airports, 11.2%<error>) trail significantly. This 3.5x difference between the South and Northeast suggests regional variation in economic priorities, land availability, and aviation culture.",
      "question": "How does the distribution of small airports reflect regional economic patterns and geographic constraints?",
      "visualization": "packed bubble chart (four regions sized proportionally with nested state bubbles)"
    },
    {
      "narration": "Analysis of airport names reveals governance patterns: 26 facilities<error> include 'Municipal' (indicating city ownership), 18 include 'County'<error> (regional authority), and 3 are 'Memorial'<error> (honoring local figures). Additional terms like 'Airpark' (2)<error>, 'State Park' (2), and 'International' (1) show functional diversity. This naming lexicon provides a window into the public ownership model that characterizes America's general aviation network.",
      "question": "What do airport naming conventions reveal about ownership structures and community priorities?",
      "visualization": "weighted word cloud with hierarchical clustering (size by frequency, color by governance type)"
    },
    {
      "narration": "Spatial analysis identifies three major clusters: a 28-airport concentration in the Texas-Oklahoma-Arkansas-Louisiana quadrangle, a 25-airport cluster spanning Alabama-Mississippi, and a 15-airport grouping in the Nebraska-South Dakota-North Dakota corridor. These clusters average 38 miles between facilities, compared to 156 miles in the Mountain West, where sparse populations require airport networks to serve as critical connectivity lifelines.",
      "question": "Where do small airports cluster, and how does spacing reflect the balance between population density and accessibility needs?",
      "visualization": "interactive bubble map (latitude/longitude plot with zoomable clusters and state boundary overlays)"
    },
    {
      "narration": "The FAA's alphanumeric location identifier system encodes geographic logic: codes beginning with '0' represent 99 airports<error> (48.3%) primarily in southern and western states, while '1' prefixes 106 airports<error> (51.7%) concentrated in the north and east. The second character reveals state groupings—0A codes cluster in Tennessee/Alabama, 0B in New England, 0F in Texas/Oklahoma/Nebraska—demonstrating a systematic regional encoding scheme that aids in navigation and airspace management.",
      "question": "What hidden geographic patterns exist within the FAA location identifier system, and how do they support aviation operations?",
      "visualization": "treemap hierarchy (first character branches → state clusters → individual airports)"
    }
  ]
}