{
  "story_title": "America's Hidden Aviation Network: 200 Small Airports Mapped",
  "story_subtitle": "A geographic analysis of municipal and regional airports reveals state-level concentration and continental-scale distribution",
  "story_pieces": [
    {
      "narration": "Alabama leads with 15 airports, followed closely by Mississippi (14) and Oklahoma (12). The top 10 states host exactly 100 airports—half the entire network—while 16 states have just one or two airports each. This creates a heavily skewed distribution where Southern and Plains states dominate small airport infrastructure.",
      "question": "Which states dominate small airport infrastructure, and how concentrated is this distribution?",
      "visualization": "chloropleth map with ranked bar chart overlay"
    },
    {
      "narration": "The network spans an extraordinary 32 degrees of latitude and 94 degrees of longitude. From Alaska's Pilot Station (61.93°N) to Louisiana's Abbeville Chris Crusta Memorial (29.98°N), and from Maine's Dexter Regional (-69.24°W) to Alaska's westernmost Pilot Station (-162.89°W). These extremes reveal small airports fill critical gaps in both remote frontier and dense coastal regions.",
      "question": "How far does America's small airport network stretch across the continent?",
      "visualization": "annotated US map highlighting four corner extremes"
    },
    {
      "narration": "The standard deviation of longitude (15.8°) is nearly three times that of latitude (5.8°), confirming airports stretch far wider east-west than north-south. This reflects America's continental geography—airports concentrate between 33°N-44°N latitude (a 800-mile north-south band) but spread across 5,000 miles of longitude from Maine to Alaska.",
      "question": "Why is the east-west spread nearly three times the north-south spread?",
      "visualization": "scatter plot with marginal histograms"
    },
    {
      "narration": "Four geographic patterns emerge: the Deep South concentration (Alabama, Mississippi, Louisiana, and Georgia host 43 airports), the Northeast corridor (New York, New Jersey, and Pennsylvania have 17), the Great Plains belt (Nebraska, Oklahoma, and Kansas total 25), and the Western dispersion (California, Nevada, and Colorado combine for 19 plus Alaska's 5 remote outposts).",
      "question": "What regional patterns emerge from this airport distribution?",
      "visualization": "small multiples map showing four key regional clusters"
    }
  ]
}