{
  "story_title": "Charting America's Airports: A Geographic and Statistical Portrait",
  "story_subtitle": "2,000 landing strips reveal surprising patterns of state leadership, continental span, and local governance",
  "story_pieces": [
    {
      "narration": "Alaska leads the United States with 170 airports—30% more than Texas (131) and over double Oklahoma (75). This dominance reflects Alaska's vast territory, sparse road infrastructure, and reliance on aviation for medical care, supplies, and connectivity in remote communities.",
      "question": "Which state operates nearly twice as many airports as any other, and what geographic necessity drives this?",
      "visualization": "ranked horizontal bar chart of top 15 states by airport count, with Alaska highlighted"
    },
    {
      "narration": "The US airport network spans extraordinary distances: from Barrow, Alaska at 71.29°N to Guam at 13.48°N, and from Adak, Alaska at 176.65°W to Puerto Rico at 65.30°W, covering 53 degrees of latitude and 111 degrees of longitude across the continent and territories.",
      "question": "What is the geographic extent of US airports from northernmost to southernmost points?",
      "visualization": "geographic scatter plot map with extreme coordinate points annotated"
    },
    {
      "narration": "The Great Plains form an aviation belt where Nebraska (53), Kansas (52), Minnesota (51), Iowa (50), and Montana (48) airports support agricultural economies and rural connectivity, with densities averaging one airport per 6,500 square miles.",
      "question": "Why do Plains states maintain such consistent airport infrastructure across multiple states?",
      "visualization": "choropleth map showing airport density normalized by land area"
    },
    {
      "narration": "Airport naming reveals governance patterns: common terms include 'Municipal' (city-owned), 'County' (county-owned), 'Regional' (multi-jurisdictional), and 'International' (border/major hubs), while Alaska uniquely uses 'SPB' (Seaplane Base) for coastal access.",
      "question": "What do airport names reveal about ownership and operational models?",
      "visualization": "word cloud of extracted naming terms from airport names"
    },
    {
      "narration": "The system extends beyond the continental US with 170 Alaska airports, 8 in Hawaii, 3 in Puerto Rico, 2 in the Northern Mariana Islands, and 1 each in Guam, American Samoa, and Washington DC—totaling 195 airports (9.75%) serving territories and unique jurisdictions.",
      "question": "How many airports serve non-contiguous states and US territories?",
      "visualization": "donut chart showing airport distribution: Continental 48 states, Alaska, Hawaii, US Territories"
    }
  ]
}