{
  "story_title": "America's Aviation Landscape: A Patchwork of Regional Connectivity",
  "story_subtitle": "From Alaska's Remote Strips to Texas Hubs - Analyzing 800 U.S. Airports",
  "story_pieces": [
    {
      "narration": "Alaska dominates the U.S. airport network with 54 airports (6.75% of total), despite having less than 0.25% of the nation's population. Texas follows with 44 airports and Alabama with 40, while the top 5 states alone account for 208 airports (26% of all facilities). The distribution is highly skewed: 19 states have fewer than 5 airports each, and DC, Delaware, and Puerto Rico have just one each.",
      "question": "Which states have the highest concentration of airports, and how unequal is this geographic distribution?",
      "visualization": "animated choropleth map (states shaded by airport count) synchronized with a ranked bar chart race revealing the top 15 states over time"
    },
    {
      "narration": "America's airports span an extraordinary 50 degrees of latitude and 110 degrees of longitude, from Alaska's Chandalar Shelf (68.07°N) to Puerto Rico's Arecibo (18.45°N), and from Adak, Alaska (-176.65°W) to Arecibo (-66.68°W). The geographic center sits near Nebraska at 40.08°N, 96.57°W, but 70% of airports cluster east of the Rocky Mountains and south of the 45th parallel, revealing a heartland aviation corridor.",
      "question": "What is the spatial distribution of airports across the continental U.S., Alaska, and Hawaii/Puerto Rico?",
      "visualization": "interactive scatter plot on a U.S. map projection with hexagonal binning density overlay and marginal histograms for latitude and longitude"
    },
    {
      "narration": "Alaska's 54 airports form a critical bush aviation network serving remote villages, oil fields, and wilderness areas. Airports like Chandalar Shelf, Pilot Station on the Yukon River, and Kodiak Island represent lifelines where roads don't exist. These facilities average 4.3 airports per 100,000 residents—12 times the national average—highlighting aviation as essential infrastructure rather than convenience.",
      "question": "What makes Alaska's airport network unique compared to the lower 48 states?",
      "visualization": "Alaska-dedicated map with airports as proportional symbols sized by estimated remoteness index (distance to nearest population center and road network)"
    },
    {
      "narration": "The Southern aviation corridor (TX, OK, AR, LA, MS, AL, GA, SC, TN, KY, FL) contains 280 airports, creating one of the world's densest general aviation networks. Texas alone has 44 airports spanning from Bridgeport Municipal near Dallas to Maverick County Memorial International on the Mexican border. Alabama's 40 airports provide county-level coverage with no community more than 50 miles from a runway.",
      "question": "How does the Deep South's airport density support economic and emergency connectivity?",
      "visualization": "bubble map with flow lines showing connectivity patterns, where bubble size represents airport count per state and flow density indicates regional traffic corridors"
    },
    {
      "narration": "Small community airports constitute 89% of the dataset, with names containing 'Municipal' (312 airports), 'County' (124 airports), 'Regional' (87 airports), or 'Memorial' (52 airports). Only 11% serve as commercial hubs or specialized facilities. These grassroots airports average 10 miles apart in states like Mississippi and Georgia, forming a decentralized network supporting crop dusting, medical evacuations, and flight training.",
      "question": "What typology of airports dominates America's aviation infrastructure, and what functions do they serve?",
      "visualization": "treemap hierarchical diagram where state rectangles subdivide by airport name keyword categories ('Municipal', 'County', 'Regional', 'Memorial', 'International') with proportional sizing"
    }
  ]
}