{
  "story_title": "America's Regional Runways: Mapping the Geography of 400 Small Airports",
  "story_subtitle": "How General Aviation Infrastructure Reveals Regional Priorities, Geographic Gaps, and the Hidden Backbone of Rural Connectivity",
  "story_pieces": [
    {
      "narration": "Alabama (22), Mississippi (21), Oklahoma (21), and Texas (20) dominate the small airport landscape with 84 facilities combined—over 21% of the entire dataset. This Southeastern concentration starkly contrasts with complete absence in Hawaii, Wyoming, Rhode Island, and Utah with only 6 airports despite its size, revealing uneven infrastructure development.",
      "question": "Why does the Southeastern US maintain such a dense network of small airports while other regions show significant geographic gaps?",
      "visualization": "choropleth map of US states (color gradient from grey for zero airports to deep blue for maximum, with interactive tooltips showing counts and ranking)"
    },
    {
      "narration": "The network spans from Shaktoolik, Alaska (64.36°N) to Edinburg, Texas (26.44°N)—a 38-degree latitudinal range covering Arctic to subtropical zones. With a mean latitude of 38.9°N, airports cluster in the temperate mid-latitudes, while longitudinally stretching from Maine (-69.23°W) to Alaska (-163.53°W), with 65% located east of the Mississippi River centerline.",
      "question": "What geographic extremes define America's small airport network, and where does density concentrate across latitudinal and longitudinal bands?",
      "visualization": "density heatmap projection (latitude-longitude scatter plot with hexbin density overlay, extreme airports annotated as callouts)"
    },
    {
      "narration": "Airport names encode ownership patterns: dozens incorporate 'Municipal' or 'County' indicating local government operation, while others like 'Sportsman Airpark' signal recreational use. Personal memorials ('William R Pogue Municipal', 'Carl Folsom') commemorate local figures, creating a tapestry of community identity distinct from commercial hubs.",
      "question": "How do naming conventions differentiate small community airports from major facilities while reflecting local ownership and purpose?",
      "visualization": "categorized word cloud (name components weighted by frequency, color-coded: government terms in blue, geographic features in green, personal names in gold, recreational terms in orange)"
    },
    {
      "narration": "Ohio (16), Illinois (15), and Michigan (13) anchor Midwestern general aviation with 44 airports, while California (16) and Colorado (11) lead the West. However, per-capita density favors smaller states—Mississippi has one airport per 1.4 million residents versus Texas's one per 1.5 million, suggesting infrastructure scales differently with geography.",
      "question": "How do airport densities compare between large Western states and smaller Southeastern/Midwestern states, and what reveals regional aviation culture?",
      "visualization": "bubble map (geographic coordinate system with each state as a bubble positioned at its geographic center, bubble area sized by airport count, color intensity showing per-capita density)"
    },
    {
      "narration": "Alaska's 12 airports (3% of total) serve remote villages inaccessible by road, functioning as essential lifelines rather than amenities. From Pilot Station (-162.89°W) to Shaktoolik (-161.20°W), these represent the highest isolation index—averaging 340+ miles from the nearest commercial hub compared to 45 miles for continental airports.",
      "question": "How do Alaska's small airports function differently than continental facilities, and what does their extreme distribution reveal about rural connectivity essentials?",
      "visualization": "Alaska-focused proportional symbol map (airports as circles sized by distance to nearest population center >50,000, with flight corridors and terrain elevation basemap)"
    }
  ]
}